#Область СлужебныеПроцедурыИФункции

#Область Методы

Функция GetInfobase( Запрос )
	
	Перем Ответ;
	
	Ответ = Новый HTTPСервисОтвет( НайтиКодСостоянияОтвета("OK") );
	Ответ.УстановитьТелоИзСтроки( ВнешниеОтчетыИОбработки.GetJson( ПолучитьОписаниеИнформационнойБазы() ) );
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

Функция НайтиКодСостоянияОтвета( Знач Идентификатор )
	
	Возврат КодыСостоянияHTTPКлиентСерверПовтИсп.НайтиКодПоИдентификатору( Идентификатор );
	
КонецФункции

Функция ПолучитьОписаниеИнформационнойБазы()
	
	Перем Результат;
	
	Результат = Новый Структура();
	Результат.Вставить( "config_version", ОбщегоНазначения.МетаданныеВерсия() );
	Результат.Вставить( "connection_string", СтрокаСоединенияИнформационнойБазы() );
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти