#Область СлужебныйПрограммныйИнтерфейс

Процедура ОчиститьСправочникВнешниеОбработки() Экспорт
	
	Выборка = Справочники.ВнешниеОбработки.Выбрать();
	Пока Выборка.Следующий() Цикл
		Обработка = Выборка.ПолучитьОбъект();
		Обработка.Удалить();
	КонецЦикла;

КонецПроцедуры

Функция СоздатьВнешнююОбработку(ИмяФайла) Экспорт
	
	ТелоФайла = ПолучитьДвоичныеДанныеИзСтроки(ИмяФайла, КодировкаТекста.UTF8);
	Обработка = Справочники.ВнешниеОбработки.СоздатьЭлемент();
	Обработка.Наименование = "Тест_" + ИмяФайла;
	Обработка.ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.Обработка;
	Обработка.ХранилищеВнешнейОбработки = Новый ХранилищеЗначения(ТелоФайла);
	Обработка.ИмяФайла = ИмяФайла;
	Обработка.КомментарийКФайлуИсточнику = "Размер: такой-то... для " + ИмяФайла;
	Обработка.Записать();
	
	Возврат Обработка;
	
КонецФункции

Процедура ДобавитьФайлВнешнейОбработкиВТабличнуюЧасть(Обработка, ИмяФайла) Экспорт
	
	ТелоФайла = ПолучитьДвоичныеДанныеИзСтроки(ИмяФайла, КодировкаТекста.UTF8);
	НоваяПринадлежность = Обработка.Принадлежность.Добавить();
	НоваяПринадлежность.ИмяФайлаПечатнойФормы = ИмяФайла;
	НоваяПринадлежность.ХранилищеВнешнейОбработки = Новый ХранилищеЗначения(ТелоФайла);
	НоваяПринадлежность.КомментарийКФайлуИсточнику = "Размер: такой-то... для " + ИмяФайла;
	Обработка.Записать();
	
КонецПроцедуры

#КонецОбласти