#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьЗагружатьФайлыИзВнешнегоХранилища() Экспорт
	
	Возврат Константы.ЗагружатьФайлыИзВнешнегоХранилища.Получить();
	
КонецФункции

Процедура УстановитьЗагружатьФайлыИзВнешнегоХранилища( Знач Значение ) Экспорт
	
	Константы.ЗагружатьФайлыИзВнешнегоХранилища.Установить( Значение );
	
КонецПроцедуры

Процедура УстановитьAccessTokenВнешнееХранилищеОтчетовИОбработок( Знач Значение ) Экспорт
	
	Константы.AccessTokenВнешнееХранилищеОтчетовИОбработок.Установить( Значение );
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти