#Область СлужебныйПрограммныйИнтерфейс

// @unit-test
Процедура Тест_HTTPServiceGitlabResponseVersion(Фреймворк) Экспорт
	
	СерверСервиса = Фреймворк.ПолучитьСохраненноеЗначениеИзКонтекстаСохраняемого("СерверСервисаGitLab");
	ПутьДоСервиса = Фреймворк.ПолучитьСохраненноеЗначениеИзКонтекстаСохраняемого("ПутьДоСервисаGitLab");
	Соединение = Новый HTTPСоединение(СерверСервиса, , , , , 5);

	HTTPЗапрос = Новый HTTPЗапрос;
	HTTPЗапрос.АдресРесурса = ПутьДоСервиса + "/version";
	
	HTTPОтвет = Соединение.ВызватьHTTPМетод("GET", HTTPЗапрос);
	Фреймворк.ПроверитьРавенство(HTTPОтвет.КодСостояния, 200, "Веб-сервис не отвечает.");
	
	// BSLLS:UsingHardcodeNetworkAddress-выкл.
	ЭталонJSON =	"{
					|	""type"": ""info"",
					|	""message"": ""10.3.5.77""
					|}";
	
	Фреймворк.ПроверитьРавенство(HTTPОтвет.ПолучитьТелоКакСтроку(), ЭталонJSON, "Ответ веб-сервиса неверный.");
	// BSLLS:UsingHardcodeNetworkAddress-вкл.
	
КонецПроцедуры

// @unit-test
Процедура Тест_HTTPServiceGitlabUpdateError423(Фреймворк) Экспорт
	
	СерверСервиса = Фреймворк.ПолучитьСохраненноеЗначениеИзКонтекстаСохраняемого("СерверСервисаGitLab");
	ПутьДоСервиса = Фреймворк.ПолучитьСохраненноеЗначениеИзКонтекстаСохраняемого("ПутьДоСервисаGitLab");
	
	Соединение = Новый HTTPСоединение(СерверСервиса, , , , , 5);

	HTTPЗапрос = Новый HTTPЗапрос;
	HTTPЗапрос.АдресРесурса = ПутьДоСервиса + "/update";
	
	// Есть ошибка 423 LOCKED
	Тест_HTTPServiceGitlabВызовСервера.УстановитьЗагружатьФайлыИзВнешнегоХранилища( Ложь );
	Тест_HTTPServiceGitlabВызовСервера.УстановитьAccessTokenВнешнееХранилищеОтчетовИОбработок("token");
		
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Length", 50);
	Заголовки.Вставить("Token", "token");
	// %D0%B8%D0%BC%D1%8F%20%D0%BE%D0%B1%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D0%BA%D0%B8 = имя обработки
	Заголовки.Вставить("Name", "%D0%B8%D0%BC%D1%8F%20%D0%BE%D0%B1%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D0%BA%D0%B8");
	HTTPЗапрос.Заголовки = Заголовки;
	ДвоичныеДанные = Новый ДвоичныеДанные(Фреймворк.Объект.КаталогПроекта + "\test\Файлы\Внешняя Обработка 1.epf");
	HTTPЗапрос.УстановитьТелоИзДвоичныхДанных(ДвоичныеДанные);
	HTTPОтвет = Соединение.ВызватьHTTPМетод("POST", HTTPЗапрос);
	
	Фреймворк.ПроверитьРавенство(HTTPОтвет.КодСостояния, 423);	
		
	// Нет ошибка 423 LOCKED
	Тест_HTTPServiceGitlabВызовСервера.УстановитьЗагружатьФайлыИзВнешнегоХранилища( Истина );
	
	HTTPЗапрос = ЭталонHTTPЗапрос(Фреймворк, HTTPЗапрос);
	HTTPОтвет = Соединение.ВызватьHTTPМетод("POST", HTTPЗапрос);
	
	Фреймворк.ПроверитьНеРавенство(HTTPОтвет.КодСостояния, 423);
	
	Тест_HTTPServiceGitlabВызовСервера.УстановитьЗагружатьФайлыИзВнешнегоХранилища( Ложь );		

КонецПроцедуры

// @unit-test
Процедура Тест_HTTPServiceGitlabUpdateError403(Фреймворк) Экспорт
	
	СерверСервиса = Фреймворк.ПолучитьСохраненноеЗначениеИзКонтекстаСохраняемого("СерверСервисаGitLab");
	ПутьДоСервиса = Фреймворк.ПолучитьСохраненноеЗначениеИзКонтекстаСохраняемого("ПутьДоСервисаGitLab");
	
	Соединение = Новый HTTPСоединение(СерверСервиса, , , , , 5);

	HTTPЗапрос = Новый HTTPЗапрос;
	HTTPЗапрос.АдресРесурса = ПутьДоСервиса + "/update";
	
	Тест_HTTPServiceGitlabВызовСервера.УстановитьЗагружатьФайлыИзВнешнегоХранилища( Истина );
	Тест_HTTPServiceGitlabВызовСервера.УстановитьAccessTokenВнешнееХранилищеОтчетовИОбработок("");
	
	// Есть ошибка 403 FORBIDDEN
	HTTPЗапрос = ЭталонHTTPЗапрос(Фреймворк, HTTPЗапрос);
	HTTPОтвет = Соединение.ВызватьHTTPМетод("POST", HTTPЗапрос);
	
	Фреймворк.ПроверитьРавенство(HTTPОтвет.КодСостояния, 403);
	
	// Нет ошибки 403 FORBIDDEN
	Тест_HTTPServiceGitlabВызовСервера.УстановитьAccessTokenВнешнееХранилищеОтчетовИОбработок("token");

	HTTPЗапрос = ЭталонHTTPЗапрос(Фреймворк, HTTPЗапрос);
	HTTPОтвет = Соединение.ВызватьHTTPМетод("POST", HTTPЗапрос);
	
	Фреймворк.ПроверитьНеРавенство(HTTPОтвет.КодСостояния, 403);
	
	Тест_HTTPServiceGitlabВызовСервера.УстановитьAccessTokenВнешнееХранилищеОтчетовИОбработок("");
	Тест_HTTPServiceGitlabВызовСервера.УстановитьЗагружатьФайлыИзВнешнегоХранилища( Ложь );

КонецПроцедуры

// @unit-test
Процедура Тест_HTTPServiceGitlabUpdateError401(Фреймворк) Экспорт
	
	СерверСервиса = Фреймворк.ПолучитьСохраненноеЗначениеИзКонтекстаСохраняемого("СерверСервисаGitLab");
	ПутьДоСервиса = Фреймворк.ПолучитьСохраненноеЗначениеИзКонтекстаСохраняемого("ПутьДоСервисаGitLab");
	
	Соединение = Новый HTTPСоединение(СерверСервиса, , , , , 5);

	HTTPЗапрос = Новый HTTPЗапрос;
	HTTPЗапрос.АдресРесурса = ПутьДоСервиса + "/update";
	
	Тест_HTTPServiceGitlabВызовСервера.УстановитьЗагружатьФайлыИзВнешнегоХранилища( Истина );
	Тест_HTTPServiceGitlabВызовСервера.УстановитьAccessTokenВнешнееХранилищеОтчетовИОбработок("true");
	
	// Есть ошибка 401 UNAUTHORIZED
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Length", 50);
	Заголовки.Вставить("Token", "false");
	Заголовки.Вставить("Name", "%D0%B8%D0%BC%D1%8F%20%D0%BE%D0%B1%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D0%BA%D0%B8");
	HTTPЗапрос.Заголовки = Заголовки;
	ДвоичныеДанные = Новый ДвоичныеДанные(Фреймворк.Объект.КаталогПроекта + "\test\Файлы\Внешняя Обработка 1.epf");
	HTTPЗапрос.УстановитьТелоИзДвоичныхДанных(ДвоичныеДанные);
	HTTPОтвет = Соединение.ВызватьHTTPМетод("POST", HTTPЗапрос);
	
	Фреймворк.ПроверитьРавенство(HTTPОтвет.КодСостояния, 401);
	
	// Нет ошибки 401 UNAUTHORIZED
	Тест_HTTPServiceGitlabВызовСервера.УстановитьAccessTokenВнешнееХранилищеОтчетовИОбработок("true");

	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Length", 50);
	Заголовки.Вставить("Token", "true");
	Заголовки.Вставить("Name", "%D0%B8%D0%BC%D1%8F%20%D0%BE%D0%B1%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D0%BA%D0%B8");
	HTTPЗапрос.Заголовки = Заголовки;
	ДвоичныеДанные = Новый ДвоичныеДанные(Фреймворк.Объект.КаталогПроекта + "\test\Файлы\Внешняя Обработка 1.epf");
	HTTPЗапрос.УстановитьТелоИзДвоичныхДанных(ДвоичныеДанные);
	HTTPОтвет = Соединение.ВызватьHTTPМетод("POST", HTTPЗапрос);
	
	Фреймворк.ПроверитьНеРавенство(HTTPОтвет.КодСостояния, 401);
	
	Тест_HTTPServiceGitlabВызовСервера.УстановитьAccessTokenВнешнееХранилищеОтчетовИОбработок("");
	Тест_HTTPServiceGitlabВызовСервера.УстановитьЗагружатьФайлыИзВнешнегоХранилища( Ложь );

КонецПроцедуры

// @unit-test
Процедура Тест_HTTPServiceGitlabUpdateError400(Фреймворк) Экспорт
	
	СерверСервиса = Фреймворк.ПолучитьСохраненноеЗначениеИзКонтекстаСохраняемого("СерверСервисаGitLab");
	ПутьДоСервиса = Фреймворк.ПолучитьСохраненноеЗначениеИзКонтекстаСохраняемого("ПутьДоСервисаGitLab");
	
	Соединение = Новый HTTPСоединение(СерверСервиса, , , , , 5);

	HTTPЗапрос = Новый HTTPЗапрос;
	HTTPЗапрос.АдресРесурса = ПутьДоСервиса + "/update";
	
	Тест_HTTPServiceGitlabВызовСервера.УстановитьЗагружатьФайлыИзВнешнегоХранилища( Истина );
	Тест_HTTPServiceGitlabВызовСервера.УстановитьAccessTokenВнешнееХранилищеОтчетовИОбработок("true");
	
	// Есть ошибка
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Length", 0);
	Заголовки.Вставить("Token", "true");
	HTTPЗапрос.Заголовки = Заголовки;
	
	ДвоичныеДанные = Новый ДвоичныеДанные(Фреймворк.Объект.КаталогПроекта + "\test\Файлы\Пустой.txt");
	HTTPЗапрос.УстановитьТелоИзДвоичныхДанных(ДвоичныеДанные);
	HTTPОтвет = Соединение.ВызватьHTTPМетод("POST", HTTPЗапрос);
	
	Фреймворк.ПроверитьРавенство(HTTPОтвет.КодСостояния, 400);
	
	// Нет ошибки
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Length", 50);
	Заголовки.Вставить("Token", "true");
	Заголовки.Вставить("Name", "%D0%B8%D0%BC%D1%8F%20%D0%BE%D0%B1%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D0%BA%D0%B8");
	HTTPЗапрос.Заголовки = Заголовки;
	ДвоичныеДанные = Новый ДвоичныеДанные(Фреймворк.Объект.КаталогПроекта + "\test\Файлы\Внешняя Обработка 1.epf");
	HTTPЗапрос.УстановитьТелоИзДвоичныхДанных(ДвоичныеДанные);
	HTTPОтвет = Соединение.ВызватьHTTPМетод("POST", HTTPЗапрос);
	
	Фреймворк.ПроверитьНеРавенство(HTTPОтвет.КодСостояния, 400);
	
	Тест_HTTPServiceGitlabВызовСервера.УстановитьAccessTokenВнешнееХранилищеОтчетовИОбработок("");
	Тест_HTTPServiceGitlabВызовСервера.УстановитьЗагружатьФайлыИзВнешнегоХранилища( Ложь );

КонецПроцедуры

// @unit-test
Процедура Тест_HTTPServiceGitlabUpdate200(Фреймворк) Экспорт
	
	СерверСервиса = Фреймворк.ПолучитьСохраненноеЗначениеИзКонтекстаСохраняемого("СерверСервисаGitLab");
	ПутьДоСервиса = Фреймворк.ПолучитьСохраненноеЗначениеИзКонтекстаСохраняемого("ПутьДоСервисаGitLab");
	
	Соединение = Новый HTTPСоединение(СерверСервиса, , , , , 5);

	HTTPЗапрос = Новый HTTPЗапрос;
	HTTPЗапрос.АдресРесурса = ПутьДоСервиса + "/update";
	
	// 200
	Тест_HTTPServiceGitlabВызовСервера.УстановитьЗагружатьФайлыИзВнешнегоХранилища( Истина );
	Тест_HTTPServiceGitlabВызовСервера.УстановитьAccessTokenВнешнееХранилищеОтчетовИОбработок("token");
	
	HTTPЗапрос = ЭталонHTTPЗапрос(Фреймворк, HTTPЗапрос);
	HTTPОтвет = Соединение.ВызватьHTTPМетод("POST", HTTPЗапрос);
	Фреймворк.ПроверитьРавенство(HTTPОтвет.КодСостояния, 200);
	Фреймворк.ПроверитьРавенство(HTTPОтвет.Заголовки.Получить("Content-Type"), "application/json");	
	
	Тест_HTTPServiceGitlabВызовСервера.УстановитьAccessTokenВнешнееХранилищеОтчетовИОбработок("");
	Тест_HTTPServiceGitlabВызовСервера.УстановитьЗагружатьФайлыИзВнешнегоХранилища( Ложь );

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЭталонHTTPЗапрос(Знач Фреймворк, Знач HTTPЗапрос)
	
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Token", "token");
	Заголовки.Вставить("Name", "%D0%B8%D0%BC%D1%8F%20%D0%BE%D0%B1%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D0%BA%D0%B8");
	HTTPЗапрос.Заголовки = Заголовки;
	ДвоичныеДанные = Новый ДвоичныеДанные(Фреймворк.Объект.КаталогПроекта + "\test\Файлы\Внешняя Обработка 1.epf");
	HTTPЗапрос.УстановитьТелоИзДвоичныхДанных(ДвоичныеДанные);
	
	Возврат HTTPЗапрос;
	
КонецФункции

#КонецОбласти