#Область ПрограммныйИнтерфейс

// КомментарийКФайлу формирует комментарий для файла внешней обработки.
// 
// Параметры:
// 	Файл - Файл - дескриптор файла;
// 	ДатаЗагрузки - Дата - дата загрузки файла в информационную базу;
//	Дополнительно - Строка - дополнительный текст, добавляемый в конец комментария;
//
// Возвращаемое значение:
// 	Строка - созданный комментарий;
//
Функция КомментарийКФайлу( Знач Файл, Знач ДатаЗагрузки, Знач Дополнительно ) Экспорт
	
	Перем Шаблон;

	Шаблон = НСтр( "ru = 'Размер: %1 байт; изменен: %2; загружен в ИБ: %3;%4';
					|en = 'Size: %1 байт; modified: %2; loaded: %3;%4'" );
	
	Возврат СтрШаблон( Шаблон, Файл.Размер(), Файл.ПолучитьВремяИзменения(), ДатаЗагрузки, Дополнительно );
	 	
КонецФункции

#КонецОбласти
