#Область СлужебныйПрограммныйИнтерфейс

Функция VersionGET( Запрос )
	
	Перем Ответ;
	
	Ответ = Новый HTTPСервисОтвет( КодОтветаHTTP.КодыОтветаHTTP().OK );
	Ответ.УстановитьТелоИзСтроки( ВнешниеОтчетыИОбработкиСервер.JSONСхемаОтвета( ВерсияКонфигурации() ) );
	
	Возврат Ответ;
	
КонецФункции

Функция UpdatePOST( Запрос )
	
	Перем ИмяФайла;
	Перем Данные;
	Перем Результат;
	Перем Ответ;

	Ответ = Новый HTTPСервисОтвет( КодОтветаHTTP.КодыОтветаHTTP().OK );
	
	ВнешниеОтчетыИОбработкиСервер.ПроверитьЗапрос( Запрос, Ответ );

	Если ( КодОтветаHTTP.isOk(Ответ.КодСостояния) ) Тогда
		
		ИмяФайла = РаскодироватьСтроку( Запрос.Заголовки.Получить("Name"), СпособКодированияСтроки.КодировкаURL );
		Данные = Запрос.ПолучитьТелоКакДвоичныеДанные();
		Результат = ВнешниеОтчетыИОбработкиСервер.СтруктураОтвета();
		
		ВнешниеОтчетыИОбработкиСервер.ОбновитьДанныеВХранилищеЗначенийПоИмениФайла( ИмяФайла, Данные, Результат );
		
		Ответ.Заголовки.Вставить( "Content-Type", "application/json" );
		Ответ.УстановитьТелоИзСтроки( ВнешниеОтчетыИОбработкиСервер.JSONСхемаОтвета( Результат ) );
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВерсияКонфигурации()
	
	Перем Результат;
	
	Результат = ВнешниеОтчетыИОбработкиСервер.СтруктураОтвета();
	Результат.Тип = "info";
	Результат.Сообщение = ОбщегоНазначения.МетаданныеВерсия();
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти