#Область ПрограммныйИнтерфейс

// SetBodyAsJSON устанавливает тело ответа HTTP-сервиса из строки в формате JSON,
// являющейся результатом сериализации переданных в процедуру данных.
// 
// Параметры:
// 	Ответ - HTTPСервисОтвет - ответ, формируемый HTTP-сервисом;
// 	Данные - Структура - произвольная структура;
//
Процедура SetBodyAsJSON( Ответ, Знач Данные ) Экспорт

	Ответ.Заголовки.Вставить( "Content-Type", "application/json" );
	Ответ.УстановитьТелоИзСтроки( GetJSON(Данные) );

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// GetJSON сериализует данные в формате json.
// 
// Параметры:
// 	Данные - Структура - произвольная структура;
// 	
// Возвращаемое значение:
// 	Строка - результат сериализации в формате json;
//
Функция GetJSON( Знач Данные )
	
	Перем ПараметрыЗаписи;
	Перем Запись;
	Перем Результат;
	
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON( ПереносСтрокJSON.Нет );
	Запись = Новый ЗаписьJSON();
	Запись.УстановитьСтроку( ПараметрыЗаписи );
	ЗаписатьJSON( Запись, Данные );
	
	Результат = Запись.Закрыть();

	Возврат Результат;
	
КонецФункции

#КонецОбласти